app/controllers/account_controller.rb

  def openid
      token = params['token']
      return_url = params['return_url']
      url = 'https://rpxnow.com/'
      api_key = 'd8de77f783c05c95c85ac9d063f548f313953739'
      rpx = Rpx::RpxHelper.new api_key, url, ''
      @profile = rpx.auth_info token
      photo = @profile['photo']
      if photo != nil && photo != ''
        session['photo_url'] = photo
      else
        session['photo_url'] = gravatar_url_for(@profile['email'])
      end
      user = {
        :user_name => @profile['preferredUsername'],
        :email => @profile['email'],
        :identifier => @profile['identifier'],
        :first_name => @profile['name']['givenName'],
        :last_name => @profile['name']['familyName']
        }
      self.current_user = User.find_by_identifier(user[:identifier]) ||
        User.create!(user)
---
INSERT INTO `users` (`created_at`, `updated_at`, `user_name`, `last_name`, `organization`, `identifier`, `email`, `first_name`) VALUES('2010-07-10 14:40:56', '2010-07-10 14:40:56', 'ClausHerther', 'Herther', NULL, 'http://www.facebook.com/profile.php?id=1075774602', 'claus_herther@yahoo.com', 'Claus')
SELECT * FROM `users` WHERE (`users`.`identifier` = 'http://www.facebook.com/profile.php?id=1075774602') LIMIT 1