app/controllers/events_controller.rb

INSERT INTO `events` (`route`, `event_series_id`, `created_at`, `start_address`, `start_lng`, `end_lng`, `title`, `updated_at`, `end_lat`, `user_id`, `start_lat`, `event_type_id`, `distance_category_id`, `description`, `end_address`, `event_date`) VALUES(NULL, NULL, '2010-07-19 12:16:23', '4446 Price Street, Los Angeles, CA, USA', -118.287043, NULL, 'Test Event', '2010-07-19 12:16:23', NULL, 1, 34.108329, 1, 3, '', NULL, '2010-07-20')
---
  def create
    @event = Event.new(params[:event])

    if @event.save

SELECT * FROM `events` WHERE (event_type_id = 1)
---
  def index
    type = params['id']
    if type != nil
      @events = Event.find(:all, :conditions => 'event_type_id = ' + type )

SELECT * FROM `events` WHERE (`events`.`id` = 1)
---
  def show
    @event = Event.find(params[:id])